In [1]:
import pandas as pd

In [2]:
import numpy as np

In [5]:
# pandas Series documentation
#help(pd.Series)

In [8]:
my_index = ["Baku", "Sumqayit", "Fizuli", "Shamaxi", "Gedebey", "Tovuz", "Ganja"]
my_index

['Baku', 'Sumqayit', 'Fizuli', 'Shamaxi', 'Gedebey', 'Tovuz', 'Ganja']

In [9]:
my_data = [10, 50, 19, 56 , 21, 60, 20]
my_data

[10, 50, 19, 56, 21, 60, 20]

In [12]:
my_series = pd.Series(my_data, index=my_index)
my_series

Baku        10
Sumqayit    50
Fizuli      19
Shamaxi     56
Gedebey     21
Tovuz       60
Ganja       20
dtype: int64

In [13]:
my_series['Sumqayit']

np.int64(50)

In [17]:
ages = {'Nadir': 45, 'Ibragim': 18, "Kamil": 19, "Imran": 16, "Rashid": 21, "Jamal": 19 }
ages

{'Nadir': 45,
 'Ibragim': 18,
 'Kamil': 19,
 'Imran': 16,
 'Rashid': 21,
 'Jamal': 19}

In [20]:
pd.Series(ages)

Nadir      45
Ibragim    18
Kamil      19
Imran      16
Rashid     21
Jamal      19
dtype: int64

In [21]:
first_month_sales = {'Nadir': 450, 'Ibragim': 1118, "Kamil": 200, "Imran": 1990 }
second_month_sales = {'Rashid': 654, 'Ibragim': 2000, "Kamil": 1905, "Jamal": 980 }

In [22]:
sales_m1 = pd.Series(first_month_sales)
sales_m2 = pd.Series(second_month_sales)

In [24]:
sales_m1

Nadir       450
Ibragim    1118
Kamil       200
Imran      1990
dtype: int64

In [25]:
sales_m2

Rashid      654
Ibragim    2000
Kamil      1905
Jamal       980
dtype: int64

In [26]:
sales_m1.keys()

Index(['Nadir', 'Ibragim', 'Kamil', 'Imran'], dtype='object')

In [28]:
sales_m1 * 0.05

Nadir      22.5
Ibragim    55.9
Kamil      10.0
Imran      99.5
dtype: float64

In [29]:
sales_m1 + sales_m2

Ibragim    3118.0
Imran         NaN
Jamal         NaN
Kamil      2105.0
Nadir         NaN
Rashid        NaN
dtype: float64

In [32]:
two_month_summ = sales_m1.add(sales_m2, fill_value=0)

In [33]:
two_month_summ

Ibragim    3118.0
Imran      1990.0
Jamal       980.0
Kamil      2105.0
Nadir       450.0
Rashid      654.0
dtype: float64

In [36]:
np.random.seed(42)
scores = np.random.randint(1, 12, (5, 6))
scores

array([[ 7,  4, 11,  8,  5,  7],
       [10,  3,  7, 11, 11,  8],
       [ 5,  4,  8,  8,  3,  6],
       [ 5,  2,  8,  6,  2,  5],
       [ 1, 10,  6,  9,  1, 11]], dtype=int32)

In [37]:
students = ['Ibragim', 'Kamil', 'Imran', 'Rashid', 'Jamal']

In [42]:
lessons = ["Python", "C++", "C#", "MSSQL", "Entity Framework", "ASP.NET"]
lessons

['Python', 'C++', 'C#', 'MSSQL', 'Entity Framework', 'ASP.NET']

In [44]:
df = pd.DataFrame(scores, columns=lessons, index=students)
df

         Python  C++  C#  MSSQL  Entity Framework  ASP.NET
Ibragim       7    4  11      8                 5        7
Kamil        10    3   7     11                11        8
Imran         5    4   8      8                 3        6
Rashid        5    2   8      6                 2        5
Jamal         1   10   6      9                 1       11

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Ibragim to Jamal
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Python            5 non-null      int32
 1   C++               5 non-null      int32
 2   C#                5 non-null      int32
 3   MSSQL             5 non-null      int32
 4   Entity Framework  5 non-null      int32
 5   ASP.NET           5 non-null      int32
dtypes: int32(6)
memory usage: 160.0+ bytes

In [47]:
employee_data_frame = pd.read_csv("employees.csv")
employee_data_frame

     ID      Name  Age     Country  Salary  ExperienceYears Remote Department
0     1      Lucy   56         USA   30854               15    Yes         IT
1     2  Victoria   46  Azerbaijan   68623               11    Yes         HR
2     3  Benjamin   32     Germany   37392               18     No  Marketing
3     4      Luna   25         USA   85680               13     No    Finance
4     5       Zoe   38      Brazil   76717                5    Yes     Design
..  ...       ...  ...         ...     ...              ...    ...        ...
95   96   Abigail   59         USA   52399               16    Yes    Finance
96   97    Harper   56         USA   76214               18    Yes         IT
97   98      Owen   58      France  116416                4     No     Design
98   99     Ethan   45         USA  100271                8    Yes     Design
99  100   Grayson   24     Germany   74064               11    Yes         HR

[100 rows x 8 columns]

In [48]:
employee_data_frame.columns

Index(['ID', 'Name', 'Age', 'Country', 'Salary', 'ExperienceYears', 'Remote',
       'Department'],
      dtype='object')

In [51]:
employee_data_frame.head(3)

   ID      Name  Age     Country  Salary  ExperienceYears Remote Department
0   1      Lucy   56         USA   30854               15    Yes         IT
1   2  Victoria   46  Azerbaijan   68623               11    Yes         HR
2   3  Benjamin   32     Germany   37392               18     No  Marketing

In [50]:
employee_data_frame.tail()

     ID     Name  Age  Country  Salary  ExperienceYears Remote Department
95   96  Abigail   59      USA   52399               16    Yes    Finance
96   97   Harper   56      USA   76214               18    Yes         IT
97   98     Owen   58   France  116416                4     No     Design
98   99    Ethan   45      USA  100271                8    Yes     Design
99  100  Grayson   24  Germany   74064               11    Yes         HR

In [53]:
employee_data_frame["Age"].mean()

np.float64(37.91)

In [54]:
employee_data_frame["Salary"].mean()

np.float64(72947.8)

In [57]:
employee_data_frame[employee_data_frame["Age"] > 50]

    ID       Name  Age     Country  Salary  ExperienceYears Remote Department
0    1       Lucy   56         USA   30854               15    Yes         IT
5    6  Sebastian   56       Japan  117092                5    Yes     Design
11  12      Riley   53         USA   82662               14    Yes  Marketing
12  13     Elijah   57      France   42688                0     No         IT
19  20     Evelyn   55      Brazil   64698               16     No  Marketing
27  28     Thomas   59         USA   79811               13     No     Design
32  33    Eleanor   54       Japan   41411                2    Yes         IT
36  37       Leah   56  Azerbaijan   38680                7    Yes         IT
48  49       Noah   52      Brazil   51918               15     No  Marketing
51  52       Ezra   53  Azerbaijan   60306                2     No         IT
52  53      Dylan   57  Azerbaijan   46646               17    Yes    Finance
56  57    Lillian   59      France   32049               12    Yes  Marketing
61  62   Isabella   51         USA  102694               15     No         IT
63  64      James   53         USA   37400               11     No    Finance
70  71       Lily   57      France   89040               19    Yes     Design
77  78       Ryan   58      France   91267                7     No    Finance
91  92       John   52     Germany   53328               12    Yes    Finance
92  93     Samuel   52      France  116831               17    Yes         IT
95  96    Abigail   59         USA   52399               16    Yes    Finance
96  97     Harper   56         USA   76214               18    Yes         IT
97  98       Owen   58      France  116416                4     No     Design

In [65]:
employee_data_frame["Country"].value_counts()

Country
USA           22
Azerbaijan    18
France        18
Brazil        17
Japan         14
Germany       11
Name: count, dtype: int64

In [66]:
employee_data_frame.groupby("Country")["Salary"].mean()

Country
Azerbaijan    72012.555556
Brazil        76001.882353
France        85016.111111
Germany       62115.000000
Japan         72384.214286
USA           67254.000000
Name: Salary, dtype: float64

In [67]:
employee_data_frame.index

RangeIndex(start=0, stop=100, step=1)

In [68]:
employee_data_frame.describe()

               ID         Age        Salary  ExperienceYears
count  100.000000  100.000000     100.00000       100.000000
mean    50.500000   37.910000   72947.80000         9.560000
std     29.011492   12.219454   27241.56386         6.075817
min      1.000000   18.000000   30854.00000         0.000000
25%     25.750000   26.750000   49860.50000         4.000000
50%     50.500000   38.000000   73540.00000        10.000000
75%     75.250000   46.250000   95972.25000        15.000000
max    100.000000   59.000000  119045.00000        19.000000

In [69]:
employee_data_frame.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
ID,100.0,50.50,29.011492,1.0,25.75,50.5,75.25,100.0
Age,100.0,37.91,12.219454,18.0,26.75,38.0,46.25,59.0
Salary,100.0,72947.80,27241.563860,30854.0,49860.50,73540.0,95972.25,119045.0
ExperienceYears,100.0,9.56,6.075817,0.0,4.00,10.0,15.00,19.0

In [70]:
employee_data_frame["Country"]

0            USA
1     Azerbaijan
2        Germany
3            USA
4         Brazil
         ...
95           USA
96           USA
97        France
98           USA
99       Germany
Name: Country, Length: 100, dtype: object

In [72]:
employee_data_frame[["Country", "Name"]]

       Country      Name
0          USA      Lucy
1   Azerbaijan  Victoria
2      Germany  Benjamin
3          USA      Luna
4       Brazil       Zoe
..         ...       ...
95         USA   Abigail
96         USA    Harper
97      France      Owen
98         USA     Ethan
99     Germany   Grayson

[100 rows x 2 columns]

In [75]:
employee_data_frame.drop("Country", axis=1, inplace=True)

In [76]:
employee_data_frame

     ID      Name  Age  Salary  ExperienceYears Remote Department
0     1      Lucy   56   30854               15    Yes         IT
1     2  Victoria   46   68623               11    Yes         HR
2     3  Benjamin   32   37392               18     No  Marketing
3     4      Luna   25   85680               13     No    Finance
4     5       Zoe   38   76717                5    Yes     Design
..  ...       ...  ...     ...              ...    ...        ...
95   96   Abigail   59   52399               16    Yes    Finance
96   97    Harper   56   76214               18    Yes         IT
97   98      Owen   58  116416                4     No     Design
98   99     Ethan   45  100271                8    Yes     Design
99  100   Grayson   24   74064               11    Yes         HR

[100 rows x 7 columns]

In [84]:
employee_data_frame.shape

(100, 6)

In [83]:
employee_data_frame.set_index("Name", inplace=True)

In [85]:
employee_data_frame.iloc[3]

ID                       4
Age                     25
Salary               85680
ExperienceYears         13
Remote                  No
Department         Finance
Name: Luna, dtype: object

In [88]:
employee_data_frame.loc["Aiden"]

ID                      9
Age                    28
Salary             117455
ExperienceYears         7
Remote                 No
Department         Design
Name: Aiden, dtype: object